pages/code.html
--- 
layout: page
title: Code
---





<div class="outline-3" id="outline-container-1">
<h3 id="sec-1">Linear &amp; Logistic Regression </h3>
<div class="outline-text-3" id="text-1">


<p>
These are a collection of exercises from OpenClassRoom machine learning classes. But serve as a good reference in translating math into code and in using matrix calculations in R. A next step could be building them into a reusable library. <i>Tool: R</i>
</p><ul>
<li>linear regression: <a href="http://al3xandr3.github.com/2011/02/24/ml-ex2-linear-regression.html">web</a>, <a href="https://github.com/al3xandr3/al3xandr3.github.com/blob/master/_org/posts/ml2.r">code</a>
</li>
<li>multivariate linear regression: <a href="http://al3xandr3.github.com/2011/03/08/ml-ex3.html">web</a>, <a href="https://github.com/al3xandr3/al3xandr3.github.com/blob/master/_org/posts/ml3.r">code</a>
</li>
<li>logistic regression and Newton's method: <a href="http://al3xandr3.github.com/2011/03/16/ml-ex4.html">web</a>, <a href="https://github.com/al3xandr3/al3xandr3.github.com/blob/master/_org/posts/ml4.r">code</a>
</li>
<li>regularized linear regression: <a href="http://al3xandr3.github.com/2011/03/18/ml-ex51.html">web</a>, <a href="https://github.com/al3xandr3/al3xandr3.github.com/blob/master/_org/posts/ml5lin.r">code</a>
</li>
<li>regularized logistic regression: <a href="http://al3xandr3.github.com/2011/03/20/ml-ex52.html">web</a>, <a href="https://github.com/al3xandr3/al3xandr3.github.com/blob/master/_org/posts/ml5log.r">code</a>
</li>
</ul>

<p><i>March 2011</i>
</p>

<hr />

</div>

</div>

<div class="outline-3" id="outline-container-2">
<h3 id="sec-2">jQuery Twitter 'mini’ plugin </h3>
<div class="outline-text-3" id="text-2">


<p>
A jQuery plugin to display a twitter feed on a web page(blog for example). The twitter api feed, i found, has an annoying particularity of not always returning the number of tweets requested, so i added a feature that until it gets the right amount of messages it keeps on fetching. Thats useful when you plan to fill a web page with exactly 3 messages.
Also added a "time ago" date calculations based of john resig <a href="http://ejohn.org/blog/javascript-pretty-date/">code</a>, with an added local timezone shift.
<i>Tools: javascript, jquery</i>
</p>
<p>
<a href="http://al3xandr3.github.com/2010/04/10/jquery-twitter-plugin.html">web</a>, <a href="https://github.com/al3xandr3/jquery-twitter-plugin"><b>code</b></a>, <i>April 2010</i>
</p>

<hr />

</div>

</div>

<div class="outline-3" id="outline-container-3">
<h3 id="sec-3">cov3 - Web Crawler Tester </h3>
<div class="outline-text-3" id="text-3">


<p>
A clojure, selenium based web crawler with a couple of variations that i found useful. Cov3 crawls pages with the intention of executing (javascript)tests/validations on each of the pages it opens. The original idea of a web crawler is that given an initial page it keeps on following all links it finds in the same domain until all pages are visited. I added a couple of variations: Given a sitemap.xml it randomly samples part of it(useful for big sitemaps) and follows those urls executing some test. And another option is a csv file, with the urls and tests to execute on each.
<i>Tools: clojure, java, selenium</i>
</p>
<p>
<a href="http://al3xandr3.github.com/2010/05/22/clojure-selenium2-crawler-cov3.html">web</a>, <a href="https://github.com/al3xandr3/cov3"><b>code</b></a>, <i>May 2010</i>
</p></div>
</div>

